results/PerconaServer/IvyBridge/throughput/dyni-select.log
sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            1822587
        write:                           0
        other:                           0
        total:                           1822587
    transactions:                        1822587 (30375.63 per sec.)
    queries:                             1822587 (30375.63 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0002s
    total number of events:              1822587

Latency (ms):
         min:                                  0.03
         avg:                                  0.03
         max:                                  1.13
         95th percentile:                      0.04
         sum:                              58990.55

Threads fairness:
    events (avg/stddev):           1822587.0000/0.00
    execution time (avg/stddev):   58.9906/0.00

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 2
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            3211434
        write:                           0
        other:                           0
        total:                           3211434
    transactions:                        3211434 (53522.39 per sec.)
    queries:                             3211434 (53522.39 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0003s
    total number of events:              3211434

Latency (ms):
         min:                                  0.03
         avg:                                  0.04
         max:                                  1.11
         95th percentile:                      0.04
         sum:                             117779.43

Threads fairness:
    events (avg/stddev):           1605717.0000/3622.00
    execution time (avg/stddev):   58.8897/0.01

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            5449510
        write:                           0
        other:                           0
        total:                           5449510
    transactions:                        5449510 (90822.51 per sec.)
    queries:                             5449510 (90822.51 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0003s
    total number of events:              5449510

Latency (ms):
         min:                                  0.03
         avg:                                  0.04
         max:                                  1.74
         95th percentile:                      0.05
         sum:                             235406.98

Threads fairness:
    events (avg/stddev):           1362377.5000/6949.84
    execution time (avg/stddev):   58.8517/0.01

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            8119183
        write:                           0
        other:                           0
        total:                           8119183
    transactions:                        8119183 (135315.21 per sec.)
    queries:                             8119183 (135315.21 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0006s
    total number of events:              8119183

Latency (ms):
         min:                                  0.04
         avg:                                  0.06
         max:                                  8.29
         95th percentile:                      0.06
         sum:                             469485.88

Threads fairness:
    events (avg/stddev):           1014897.8750/1955.59
    execution time (avg/stddev):   58.6857/0.01

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            8237644
        write:                           0
        other:                           0
        total:                           8237644
    transactions:                        8237644 (137288.24 per sec.)
    queries:                             8237644 (137288.24 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0011s
    total number of events:              8237644

Latency (ms):
         min:                                  0.04
         avg:                                  0.12
         max:                                788.95
         95th percentile:                      0.16
         sum:                             949007.54

Threads fairness:
    events (avg/stddev):           514852.7500/5315.00
    execution time (avg/stddev):   59.3130/0.01

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            8176079
        write:                           0
        other:                           0
        total:                           8176079
    transactions:                        8176079 (136259.91 per sec.)
    queries:                             8176079 (136259.91 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0022s
    total number of events:              8176079

Latency (ms):
         min:                                  0.05
         avg:                                  0.23
         max:                                 33.97
         95th percentile:                      0.29
         sum:                            1909408.10

Threads fairness:
    events (avg/stddev):           255502.4688/1922.10
    execution time (avg/stddev):   59.6690/0.00

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            8109688
        write:                           0
        other:                           0
        total:                           8109688
    transactions:                        8109688 (135148.24 per sec.)
    queries:                             8109688 (135148.24 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0045s
    total number of events:              8109688

Latency (ms):
         min:                                  0.04
         avg:                                  0.47
         max:                                710.12
         95th percentile:                      0.55
         sum:                            3829273.82

Threads fairness:
    events (avg/stddev):           126713.8750/772.56
    execution time (avg/stddev):   59.8324/0.00

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            7736687
        write:                           0
        other:                           0
        total:                           7736687
    transactions:                        7736687 (128914.61 per sec.)
    queries:                             7736687 (128914.61 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0127s
    total number of events:              7736687

Latency (ms):
         min:                                  0.04
         avg:                                  0.99
         max:                              20024.59
         95th percentile:                      1.18
         sum:                            7668809.45

Threads fairness:
    events (avg/stddev):           60442.8672/17316.21
    execution time (avg/stddev):   59.9126/0.02